Revit 2027 API
ParameterTypeId.ViewDepth Property
 "View Depth"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewDepth { get; }
Public Shared ReadOnly Property ViewDepth As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewDepth {
	ForgeTypeId^ get ();
}
static member ViewDepth : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace